'''
 Найдите количество вхождения 'aba' в строку.
 '''
a = input("Word? ")
b = a.count('aba')
print(b)
