'''
Дана строка. Если она начинается на 'abc', то заменить их на 'www', иначе
добавить в конец строки 'zzz'
'''
a = input("Word? ")
b = a[:4]
if a[:3] == "abc"
  print(a.replaced("abc" "www")
else:
 print(a + "zzz")
