'''
 Дана строка. Вывести первый, последний и средний (если он есть)) символы.
'''

a = input("Word? ")
b = len(a)
print('first letter  ' a[0])
print('last letter. ' a[-1])
if (b = 3) | (b == 4):
  print(a[1])
elif (b == 5) | (b == 6):
  print(a[2])
else:
  print(a[3])
