'''
Определить, содержит ли строка только символы 'a', 'b', 'c' или нет
'''
a = input("Word? ")
if a == 'abc':
  print('Yess')
else:
 print("No")
